{
  "backend/main.mo": "Motoko canister implementing user-scoped profiles and goal tracking with access control, goal creation, retrieval, and completion toggling.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend UI, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base stylesheet defining a warm OKLCH color theme and light/dark mode CSS variables.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app managing theme, authentication gate, profile setup, and navigation between Today, Goals, and History screens.",
  "frontend/src/components/AppHeader.tsx": "Responsive header showing logo, user greeting, navigation tabs, and login button.",
  "frontend/src/components/AppShell.tsx": "App layout wrapper providing background, header, main content area, and footer.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper showing a login screen or loading state before rendering authenticated content.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to load and save the current user's profile through the actor.",
  "frontend/src/hooks/useGoalQueries.ts": "React Query hooks for fetching, creating, archiving, and toggling completion of goals via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login, and stored identity loading.",
  "frontend/src/index.css": "Tailwind base styles and warm-themed CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React, React Query, and Internet Identity provider before rendering the app.",
  "frontend/src/screens/GoalsManagement.tsx": "UI to view active and archived goals, create new ones, and archive existing goals.",
  "frontend/src/screens/HistoryView.tsx": "Displays goal completion history for a selected date using a calendar and daily goal data.",
  "frontend/src/screens/TodayDashboard.tsx": "React screen that displays daily goals for a selected date, handles loading/error states, and allows toggling goal completion.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings with custom design tokens.",
  "project_state.json": "Project metadata describing app purpose, features, requirements, and pending feature requests for the Daily Goals app."
}